[
  {
    "subject": "Your account has been locked. Immediate action required.",
    "body": "Dear customer,\n\nWe have noticed suspicious activity on your banking account. "
            "To restore full access, please verify your details using the link below:\n\n"
            "http://secure-bank-verify-login.com/update\n\n"
            "If you do not act within 24 hours, your account will be permanently suspended.\n\n"
            "Bank Security Team",
    "is_phishing": true,
    "level": "basic"
  },
  {
    "subject": "Password change confirmation",
    "body": "Hello,\n\nThis is a confirmation that your password was changed successfully. "
            "If this was NOT you, please open the official banking app or website and reset "
            "your password from there. Do not click links from unexpected emails.\n\n"
            "Thank you,\nYour Bank",
    "is_phishing": false,
    "level": "basic"
  },
  {
    "subject": "You have won a new smartphone!",
    "body": "Congratulations!\n\nYou have been randomly selected to win a brand new smartphone. "
            "To claim your prize, simply click the link below and enter your full name, address, "
            "ID number and bank card details:\n\n"
            "http://free-giveaway-prize-claim.com\n\n"
            "Offer expires in 30 minutes. Do not miss out!",
    "is_phishing": true,
    "level": "basic"
  },
  {
    "subject": "Security tip of the month",
    "body": "Hi,\n\nThis is your monthly security tip newsletter. This month, we remind you to "
            "never share your password or OTP with anyone. If you suspect a phishing email, report it "
            "to your IT or security team.\n\n"
            "Best regards,\nSecurity Awareness Team",
    "is_phishing": false,
    "level": "basic"
  },
  {
    "subject": "Unusual login attempt detected",
    "body": "Hello,\n\nWe detected an unusual login attempt on your email account from a new device. "
            "If this was you, you can safely ignore this message. If not, please go to the official "
            "webmail website by typing the address into your browser and change your password.\n\n"
            "IT Security",
    "is_phishing": false,
    "level": "basic"
  },
  {
    "subject": "Your OTP code: DO NOT SHARE",
    "body": "Your one-time password (OTP) is: 492817\n\nIf you did not request this code, someone may "
            "be trying to access your account. Do NOT share this code with anyone by email, SMS or phone.\n\n"
            "Account Security",
    "is_phishing": false,
    "level": "basic"
  },
  {
    "subject": "Important: Verify your employee portal access",
    "body": "Dear employee,\n\nWe have introduced a new security layer for the employee portal. "
            "To avoid losing access, please confirm your login details at the link below:\n\n"
            "http://employee-portal-secure-login.com/verify\n\n"
            "Failure to act today will result in a temporary suspension of your account.\n\n"
            "IT Support",
    "is_phishing": true,
    "level": "intermediate"
  },
  {
    "subject": "Reminder: Submit your timesheet",
    "body": "Hello,\n\nThis is a reminder to submit your timesheet in the official HR portal "
            "before Friday 17:00. Log in using the same internal link or bookmark you always use.\n\n"
            "Best regards,\nHR Team",
    "is_phishing": false,
    "level": "intermediate"
  },
  {
    "subject": "Urgent: Salary payment verification required",
    "body": "Hi,\n\nDue to a system upgrade, we need to confirm your bank account details so that "
            "your salary is not delayed. Please reply to this email with your full name, bank name, "
            "account number and branch code.\n\nThank you,\nPayroll Department",
    "is_phishing": true,
    "level": "intermediate"
  },
  {
    "subject": "Meeting follow-up: Project notes attached",
    "body": "Hi team,\n\nAttached are the meeting notes from today's project call. The file is a "
            "standard PDF summarising tasks and decisions. No urgent action is required; this is "
            "only for your reference.\n\n"
            "Regards,\nProject Coordinator",
    "is_phishing": false,
    "level": "intermediate"
  },
  {
    "subject": "Security Notice: Unusual login to your email account",
    "body": "Hello,\n\nWe detected a login to your email account from a new location. If this was not "
            "you, please review your account activity by logging into the official webmail portal. "
            "Do not click on links from unexpected messages or share your password or OTP.\n\n"
            "IT Security",
    "is_phishing": false,
    "level": "intermediate"
  },
  {
    "subject": "Action required: New VPN client installation",
    "body": "Dear user,\n\nTo keep remote connections secure, we require all staff to install the "
            "attached VPN client immediately. Open the attached file vpn_update.exe and follow the "
            "instructions.\n\nIT Administration",
    "is_phishing": true,
    "level": "intermediate"
  },
  {
    "subject": "Payment request from trusted vendor",
    "body": "Hi,\n\nPlease find attached the updated invoice from our long-term vendor. Note that their "
            "bank account details have changed due to an internal audit. Make sure all future payments "
            "use the new bank account listed in the attached document.\n\n"
            "Vendor Accounts Team",
    "is_phishing": true,
    "level": "advanced"
  },
  {
    "subject": "Urgent: CEO request for confidential wire transfer",
    "body": "Hello,\n\nI am currently in a meeting and cannot be disturbed. I need you to urgently "
            "process a confidential wire transfer of funds to the following account for a sensitive "
            "acquisition. Do not call me; just reply to this email when the transfer is complete.\n\n"
            "This is highly confidential.\n\n"
            "Regards,\nChief Executive Officer",
    "is_phishing": true,
    "level": "advanced"
  },
  {
    "subject": "Security training: Phishing simulation results",
    "body": "Hi,\n\nThank you for participating in our recent phishing simulation exercise. Your results "
            "are now available in the official training portal. Please log in using your normal company "
            "credentials. We will never ask you to enter your password on any site outside the corporate "
            "domain.\n\n"
            "Security Awareness Team",
    "is_phishing": false,
    "level": "advanced"
  },
  {
    "subject": "Mailbox quota exceeded – action required",
    "body": "Dear user,\n\nYour mailbox has exceeded the storage limit and some emails may not be "
            "delivered. To restore full functionality, please log in to the web portal using the link "
            "below and confirm your account details:\n\n"
            "http://webmail-it-support-quota.com/login\n\n"
            "Failure to act may result in permanent loss of messages.\n\n"
            "Mail Administrator",
    "is_phishing": true,
    "level": "advanced"
  },
  {
    "subject": "Invoice query: confirmation of bank details",
    "body": "Hi Finance,\n\nWe noticed that the last invoice was paid to our old bank account. Please use "
            "the updated account details in the attached PDF for all future payments. This change is "
            "effective immediately and must be followed today.\n\n"
            "Best regards,\nAccounts Department",
    "is_phishing": true,
    "level": "advanced"
  },
  {
    "subject": "Internal security review meeting",
    "body": "Hello team,\n\nYou are invited to an internal security review meeting next week to discuss "
            "recent phishing attempts and how to handle them. The invite has also been sent via the "
            "official calendar system. No attachments are included in this email.\n\n"
            "Kind regards,\nInformation Security Office",
    "is_phishing": false,
    "level": "advanced"
  }
]
